from datetime import time, timedelta

from lesson_timetable.days import Day
from lesson_timetable.lessons import Lesson
from lesson_timetable.table import TimeTable


times: list[list[tuple[time | timedelta] | time]] = [[
    time(8, 25),
    (time(9, 20), timedelta(hours=1, minutes=45)),
    time(11, 25),
    time(12, 20),
    time(13, 25),
    time(14, 30),
    time(15, 25)
]] + [[
    (time(8, 25), timedelta(hours=1, minutes=45)),
    time(10, 20),
    time(11, 25),
    time(12, 20),
    time(13, 25),
    time(14, 30),
    time(15, 25)
] for i in range(4)]

lessons = [
    [
        "Разговоры о важном",
        "Главный урок",
        "Физика",
        "Танцы",
        "Танцы",
        "Русский по классам",
        "Математика"
    ],
    [
        "Главный урок",
        "Обществознание",
        "Информатика",
        "Математика",
        "Русский по группам",
        "Информатика",
        "Информатика",
    ],
    [
        "Главный урок",
        "Русский по группам",
        "Физика",
        "Ботмеровская гимнастика",
        "Информатика",
        "Информатика",
        "Искусство",
    ],
    [
        "Главный урок",
        "Математика",
        "Информатика",
        "Русский по группам",
        "Физика",
        "Математика",
        "Физика",
    ],
    [
        "Главный урок",
        "Физика",
        "Математика",
        "Математика",
        "Информатика",
        "Математика",
        "Математика",
    ],
]

teachers = {
    "Главный урок": None,
    "Разговоры о важном": "Марфина Валерия Алексеевна",
    "Информатика": "Акимов Дмитрий Валерьевич",
    "Математика": "Сахарова Ольга Викторовна",
    "Физика": "Козлова Татьяна Викторовна",
    "Танцы": None,
    "Русский по классам": "Марфина Валерия Алексеевна",
    "Русский по группам": "Анна Юрьевна",
    "Обществознание": "Бланк Данила Алексеевич",
    "Ботмеровская гимнастика": "Ольга Владимировна",
    "Искусство": "Маргарита Григорьевна",
}


table = TimeTable(*(
    Day(
        *[
            Lesson(lesson, t[0], teachers[lesson], duration=t[1]) if isinstance(t, tuple) else
            Lesson(lesson, t, teachers[lesson])
            for lesson, t in zip(day, times[i])
        ]
    ) for i, day in enumerate(lessons)
))
